# Задание №1
print("Задание №1 — числа от 1 до 10:")
num = 1  # начальное значение счётчика
while num <= 10:  # условие: пока num меньше или равно 10
    print(num)
    num += 1  # увеличиваем счётчик на 1 после каждой итерации

# Задание №2
print("\nЗадание №2 — числа от 100 до 1:")
num = 100  # начальное значение счётчика — 100
while num >= 1:  # условие: пока num больше или равно 1
    print(num)
    num -= 1  # уменьшаем счётчик на 1 после каждой итерации

# Задание №3
print("\nЗадание №3 — нечётные числа от 1 до 100:")
num = 1  # начинаем с первого нечётного числа
while num <= 100:  # условие: пока num меньше или равно 100
    print(num)
    num += 2  # увеличиваем на 2 — так переходим к следующему нечётному числу (1 → 3 → 5 → ...)

